doc/challenge.html
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org555d18d">1. HEGP Challenge</a>
<ul>
<li><a href="#org33eb41e">1.1. Sharing genotype data!</a></li>
<li><a href="#org56c3cec">1.2. Is this encryption safe?</a></li>
<li><a href="#orgbe706dd">1.3. What is the challenge?</a></li>
</ul>
</li>
<li><a href="#org44a6c73">2. Who wins?</a></li>
</ul>
</div>
</div>
<div id="outline-container-org555d18d" class="outline-2">
<h2 id="org555d18d"><span class="section-number-2">1</span> HEGP Challenge</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Homomorphic Encryption of Genotypes and Phenotypes (HEGP)</i>
</p>

<p>
Here we announce the HEGP Challenge, with a prize for the person or
group who can crack the code!
</p>
</div>

<div id="outline-container-org33eb41e" class="outline-3">
<h3 id="org33eb41e"><span class="section-number-3">1.1</span> Sharing genotype data!</h3>
<div class="outline-text-3" id="text-1-1">
<p>
With a <a href="https://www.genetics.org/content/215/2/359">publication in Genetics</a> we present a novel homomorphic
encryption method named HEGP that allows for sharing of genotypes and
phenotypes in the context of Genome Wide Association (GWA)
studies. Importantly sharing but without giving away <b>private</b>
information and making individuals identifiable.
</p>

<p>
With HEGP anyone can freely hand over genotype and phenotype data to
anyone else and have them reproduce the results.
</p>

<p>
Even better, they can use that data to add to their own analysis. And
they can share their data with us! As such, genotype data can be
stored on (public) servers and GWA analysis can be reproduced.
</p>

<p>
This is a breakthrough in <a href="https://en.wikipedia.org/wiki/FAIR_data">FAIR data</a> sharing and contrasts greatly with
current practices of hiding/protecting genotype data and only
providing summary statistics (which are not reproducible).
</p>
</div>
</div>

<div id="outline-container-org56c3cec" class="outline-3">
<h3 id="org56c3cec"><span class="section-number-3">1.2</span> Is this encryption safe?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We tried find ways of cracking the code as discussed in our <a href="https://www.genetics.org/content/215/2/359">paper</a>.
Brute force guessing of a solution would take more compute seconds
than there are molecules in the universe.
</p>
</div>
</div>

<div id="outline-container-orgbe706dd" class="outline-3">
<h3 id="orgbe706dd"><span class="section-number-3">1.3</span> What is the challenge?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The challenge consists of decrypting two data sets.
</p>

<p>
For the first challenge we encrypted a data set consisting of data from
genotypes already in the public domain. We consider the code cracked
if you can identify 5 individuals correctly.
</p>

<p>
The second challenge is harder. We encrypted an unknown data set. We
consider the code cracked if you compute 30% of the genotypes of this
matrix correctly (we specify the margin of error).
</p>
</div>
</div>
</div>

<div id="outline-container-org44a6c73" class="outline-2">
<h2 id="org44a6c73"><span class="section-number-2">2</span> Who wins?</h2>
<div class="outline-text-2" id="text-2">
<p>
The best result with a publicly reproducible solution submitted by
October 1st 2020 wins the HEGP Challenge and a cash prize of one
thousand dollars. In case of a tie the prize is shared. If there is no
winner we will hold the prize until someone claims it.
</p>
</div>
</div>
</div>

